# Luento 1 (14.1.2026): Tutustutaan ohjelmointiympäristöön sekä pandas-kirjastoon

In [1]:
# tämä on kommentti koodisolussa
a = 1
b = 2
a+b

3

## Kirjaston tuominen

In [2]:
import pandas as pd

# Aineiston tuominen ja lukeminen

In [4]:
df = pd.read_excel("data1.xlsx")

In [5]:
df

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,NaN,1.0,1.0,NaN
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2,1.0,NaN,NaN,NaN
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3,1.0,NaN,1.0,NaN
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3,NaN,NaN,NaN,NaN
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4,1.0,NaN,NaN,NaN

In [6]:
# vilkaistaan aineiston alkua
df.head()

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN

In [8]:
# vilkaistaan aineiston loppua
df.tail()

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,NaN,1.0,1.0,NaN
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2,1.0,NaN,NaN,NaN
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3,1.0,NaN,1.0,NaN
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3,NaN,NaN,NaN,NaN
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4,1.0,NaN,NaN,NaN

In [9]:
# taulukon rivit 15-20
df[15:21]

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
15,16,2,42,2,3.0,23.0,2691,3,3.0,3,3,3,1.0,NaN,NaN,1.0
16,17,1,26,1,4.0,2.0,5225,5,5.0,5,4,5,NaN,NaN,1.0,NaN
17,18,2,38,2,3.0,17.0,2729,4,3.0,4,2,1,NaN,NaN,NaN,NaN
18,19,1,42,1,3.0,20.0,2925,2,3.0,4,1,4,1.0,NaN,NaN,1.0
19,20,2,40,2,2.0,13.0,2457,3,3.0,4,3,2,1.0,NaN,NaN,1.0
20,21,2,40,2,3.0,20.0,2691,2,4.0,5,3,4,NaN,NaN,NaN,NaN

In [12]:
# pelkkä ikä-muuttuja
df["ikä"]

0     38
1     29
2     30
3     36
4     24
      ..
77    22
78    33
79    27
80    35
81    35
Name: ikä, Length: 82, dtype: int64

In [13]:
# tiettyyn taulukon osaan (tiettyihin riveihin ja sarakkeisiin) pääsee käsiksi loc-toiminnolla
df.loc[[2, 3, 5], ["ikä", "palkka"]]

   ikä  palkka
2   30    1989
3   36    2144
5   31    1910

In [14]:
# rivien ja sarakkeiden lkm
df.shape

(82, 16)

In [15]:
# kuinka paljon muuttujittain on ei-puuttuvia arvoja
df.count()

nro         82
sukup       82
ikä         82
perhe       82
koulutus    81
palveluv    80
palkka      82
johto       82
työtov      81
työymp      82
palkkat     82
työteht     82
työterv     47
lomaosa     20
kuntosa      9
hieroja     22
dtype: int64

In [16]:
# Kuinka paljon puuttuvia arvoja on muuttujittain?
df.isnull().sum()

nro          0
sukup        0
ikä          0
perhe        0
koulutus     1
palveluv     2
palkka       0
johto        0
työtov       1
työymp       0
palkkat      0
työteht      0
työterv     35
lomaosa     62
kuntosa     73
hieroja     60
dtype: int64

In [17]:
# tarkempaa tietoja muuttujista
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 16 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   nro       82 non-null     int64
 1   sukup     82 non-null     int64
 2   ikä       82 non-null     int64
 3   perhe     82 non-null     int64
 4   koulutus  81 non-null     float64
 5   palveluv  80 non-null     float64
 6   palkka    82 non-null     int64
 7   johto     82 non-null     int64
 8   työtov    81 non-null     float64
 9   työymp    82 non-null     int64
 10  palkkat   82 non-null     int64
 11  työteht   82 non-null     int64
 12  työterv   47 non-null     float64
 13  lomaosa   20 non-null     float64
 14  kuntosa   9 non-null      float64
 15  hieroja   22 non-null     float64
dtypes: float64(7), int64(9)
memory usage: 10.4 KB

In [18]:
# selvitetään mitä eri arvoja muuttujalla koulutus on
df["koulutus"].unique()

array([ 1.,  2.,  3.,  4., nan])

In [ ]:
# käydään for-silmukalla läpi kaikki muuttujat
for i in df:
    print(i, df[i].unique())

nro [ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48
 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72
 73 74 75 76 77 78 79 80 81 82]
sukup [1 2]
ikä [38 29 30 36 24 31 49 55 40 33 39 35 58 53 42 26 47 44 43 56 21 45 59 37
 28 50 32 51 22 34 27 41 25 61 20 52 46]
perhe [1 2]
koulutus [ 1.  2.  3.  4. nan]
palveluv [22. 10.  7. 14.  4. 16.  0. 23. 21. 15. 12.  2. 17. 20. 13. 27.  1.  3.
 nan 24.  5.  9.  6. 35. 28. 18. 36. 19.  8.]
palkka [3587 2963 1989 2144 2183 1910 2066 2768 2106 2651 2846 2808 3393 2691
 5225 2729 2925 2457 4874 3510 4446 1521 2223 1949 2340 6278 1559 2027
 2300 2534 1872 2261 2417 3119 2574 1715 5069 2495 3470 1598 1638 2612]
johto [3 1 2 4 5]
työtov [ 3.  5.  4.  2. nan]
työymp [3 2 1 5 4]
palkkat [3 1 2 4 5]
työteht [3 2 4 1 5]
työterv [nan  1.]
lomaosa [nan  1.]
kuntosa [nan  1.]
hieroja [nan  1.]

In [21]:
# poimitaan aineistosta viisi suurinta palkkaa
df.nlargest(5, "palkka")

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
32,33,1,59,2,3.0,15.0,6278,4,4.0,5,4,4,NaN,1.0,NaN,NaN
16,17,1,26,1,4.0,2.0,5225,5,5.0,5,4,5,NaN,NaN,1.0,NaN
66,67,1,37,2,4.0,8.0,5069,3,4.0,3,2,2,1.0,1.0,NaN,1.0
21,22,1,47,2,3.0,17.0,4874,2,4.0,3,2,4,NaN,1.0,NaN,NaN
23,24,1,36,1,3.0,7.0,4446,3,4.0,3,4,5,NaN,NaN,NaN,NaN

In [22]:
# poimitaan aineistosta viisi pienintä palkkaa
df.nsmallest(5, "palkka")

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
25,26,1,26,1,2.0,3.0,1521,2,4.0,2,1,3,1.0,NaN,1.0,1.0
35,36,1,31,2,3.0,0.0,1559,2,4.0,3,1,3,1.0,NaN,NaN,NaN
53,54,1,25,1,2.0,1.0,1559,2,4.0,3,1,2,1.0,NaN,NaN,NaN
75,76,1,37,1,2.0,15.0,1598,1,5.0,1,1,1,1.0,NaN,NaN,NaN
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,NaN,1.0,1.0,NaN

## Aineiston suodatukset

In [26]:
# poimitaan työntekijät, joiden palkka on alle 2000 euroa:
df[df["palkka"] > 2000]

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN
6,7,1,49,1,2.0,16.0,2066,3,5.0,4,2,2,NaN,NaN,1.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73,74,1,45,2,1.0,20.0,2846,3,5.0,1,1,3,1.0,NaN,NaN,NaN
76,77,1,39,1,2.0,22.0,2183,4,5.0,3,1,2,NaN,NaN,NaN,NaN
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3,1.0,NaN,1.0,NaN
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3,NaN,NaN,NaN,NaN
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4,1.0,NaN,NaN,NaN

In [29]:
# työntekijät, joiden palkka on korkeintaan 2000 euroa ja ikä vähintään 50 vuotta

df[(df["palkka"] <= 2000) & (df["ikä"] >= 50)]

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
45,46,2,51,2,1.0,28.0,1989,3,3.0,2,2,3,1.0,NaN,NaN,1.0
62,63,2,51,2,2.0,10.0,1872,4,3.0,2,2,3,1.0,NaN,NaN,NaN

In [30]:
# työntekijät, joiden palkka on korkeintaan 2000 euroa tai ikä vähintään 50 vuotta

df[(df["palkka"] <= 2000) | (df["ikä"] >= 50)]

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN
5,6,2,31,2,2.0,14.0,1910,4,4.0,5,2,4,1.0,1.0,NaN,NaN
7,8,1,55,1,1.0,0.0,2066,3,5.0,3,1,3,1.0,NaN,NaN,NaN
13,14,1,58,2,3.0,21.0,3587,4,5.0,4,1,3,NaN,NaN,NaN,NaN
14,15,1,53,2,3.0,12.0,3393,4,4.0,4,4,4,NaN,1.0,NaN,NaN
25,26,1,26,1,2.0,3.0,1521,2,4.0,2,1,3,1.0,NaN,1.0,1.0
26,27,1,26,1,2.0,2.0,1989,2,4.0,2,2,3,1.0,NaN,NaN,1.0
27,28,2,56,1,1.0,15.0,2223,3,4.0,3,2,4,1.0,NaN,NaN,1.0
29,30,1,21,1,NaN,NaN,1949,4,4.0,3,3,2,1.0,NaN,NaN,NaN
32,33,1,59,2,3.0,15.0,6278,4,4.0,5,4,4,NaN,1.0,NaN,NaN
34,35,1,28,2,2.0,5.0,1989,3,4.0,3,3,3,1.0,NaN,1.0,1.0
35,36,1,31,2,3.0,0.0,1559,2,4.0,3,1,3,1.0,NaN,NaN,NaN
36,37,2,56,2,2.0,17.0,2729,5,5.0,5,5,5,NaN,NaN,NaN,1.0
37,38,1,50,2,1.0,1.0,2027,5,5.0,4,1,4,1.0,1.0,NaN,NaN
44,45,1,55,2,1.0,35.0,2651,4,5.0,4,2,4,1.0,NaN,NaN,1.0
45,46,2,51,2,1.0,28.0,1989,3,3.0,2,2,3,1.0,NaN,NaN,1.0
46,47,2,22,1,3.0,21.0,1872,3,3.0,4,1,3,NaN,NaN,1.0,NaN
52,53,1,44,2,1.0,3.0,1989,1,2.0,2,1,1,1.0,NaN,NaN,NaN
53,54,1,25,1,2.0,1.0,1559,2,4.0,3,1,2,1.0,NaN,NaN,NaN
55,56,2,31,2,1.0,6.0,1949,4,4.0,4,3,3,1.0,NaN,NaN,1.0
56,57,1,61,2,2.0,36.0,3119,2,NaN,2,1,5,1.0,NaN,NaN,1.0
61,62,1,40,2,1.0,0.0,1872,2,3.0,1,2,3,1.0,NaN,NaN,NaN
62,63,2,51,2,2.0,10.0,1872,4,3.0,2,2,3,1.0,NaN,NaN,NaN
63,64,2,44,1,2.0,1.0,1715,4,4.0,3,2,3,1.0,NaN,NaN,1.0
69,70,1,52,2,2.0,22.0,3119,3,4.0,3,2,2,1.0,1.0,NaN,1.0
74,75,1,40,1,1.0,1.0,1949,1,5.0,1,1,1,1.0,NaN,NaN,NaN
75,76,1,37,1,2.0,15.0,1598,1,5.0,1,1,1,1.0,NaN,NaN,NaN
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,NaN,1.0,1.0,NaN
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2,1.0,NaN,NaN,NaN

## Aineiston muutokset

In [32]:
# muodostetaan uusi muuttuja "syntymävuosi"
df["syntymävuosi"] = 2026 - df["ikä"]
df.head()

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja,syntymävuosi
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN,1988
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN,1997
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN,1996
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN,1990
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN,2002

In [41]:
# luodaan muuttuja, joka laskee kuinka montaa etuisuutta työntekijä on käyttänyt:
df["käyttö"] = df[["työterv", "lomaosa", "kuntosa", "hieroja"]].count(axis=1)

In [42]:
df.head()

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja,syntymävuosi,käyttö
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN,1988,0
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN,1997,0
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN,1996,1
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN,1990,1
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN,2002,1

In [49]:
# muokataan rivillä 4 olevan henkilön ikää
df.loc[4, "ikä"] = 124
df.head()

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja,syntymävuosi,käyttö
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN,1988,0
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN,1997,0
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN,1996,1
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN,1990,1
4,125,125,124,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125

In [52]:
# tiputetaan pois ne rivit, joilla on puuttuvia arvoja työterv- tai lomaosa-muuttujissa:
df.dropna(subset=["työterv", "lomaosa"])

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja,syntymävuosi,käyttö
4,125,125,124,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
5,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
6,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
7,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
8,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
78,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
79,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
80,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
81,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125

In [55]:
# järjestetään työntekijät iän mukaan vanhimmasta nuorimpaan
df.sort_values(by="ikä", ascending=False)

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja,syntymävuosi,käyttö
41,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
42,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
60,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
59,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
58,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,125,125,124,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN,1988,0
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN,1990,1
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN,1996,1
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN,1997,0

In [57]:
# tiputetaan pois muuttujat ikä ja palkka:
df.drop(columns=["ikä", "palkka"])

,nro,sukup,perhe,koulutus,palveluv,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja,syntymävuosi,käyttö
0,1,1,1,1.0,22.0,3,3.0,3,3,3,NaN,NaN,NaN,NaN,1988,0
1,2,1,2,2.0,10.0,1,5.0,2,1,3,NaN,NaN,NaN,NaN,1997,0
2,3,1,1,1.0,7.0,3,4.0,1,1,3,1.0,NaN,NaN,NaN,1996,1
3,4,1,2,1.0,14.0,3,3.0,3,3,3,1.0,NaN,NaN,NaN,1990,1
4,125,125,125,125.0,125.0,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,125,125,125,125.0,125.0,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
78,125,125,125,125.0,125.0,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
79,125,125,125,125.0,125.0,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
80,125,125,125,125.0,125.0,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
81,125,125,125,125.0,125.0,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125

In [58]:
# tiputetaan rivit 1 ja 2:
df.drop(index=[1, 2])

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja,syntymävuosi,käyttö
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN,1988,0
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN,1990,1
4,125,125,124,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
5,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
6,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
78,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
79,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
80,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125
81,125,125,125,125,125.0,125.0,125,125,125.0,125,125,125,125.0,125.0,125.0,125.0,125,125